---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.MEPNetworkIterator
source: html/46affa0e-5f2c-9e08-6eb7-b05e2b655b65.htm
---
# MEPNetworkIterator Methods

Checks if the network iteration has completed.